###################################################################

# Created by write_sdc on Tue May  1 11:30:27 2018

###################################################################
set sdc_version 1.9

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current uA
set_max_area 0
set_fanout_load 8 [get_ports memread]
set_fanout_load 8 [get_ports memwrite]
set_fanout_load 8 [get_ports {adr[7]}]
set_fanout_load 8 [get_ports {adr[6]}]
set_fanout_load 8 [get_ports {adr[5]}]
set_fanout_load 8 [get_ports {adr[4]}]
set_fanout_load 8 [get_ports {adr[3]}]
set_fanout_load 8 [get_ports {adr[2]}]
set_fanout_load 8 [get_ports {adr[1]}]
set_fanout_load 8 [get_ports {adr[0]}]
set_fanout_load 8 [get_ports {writedata[7]}]
set_fanout_load 8 [get_ports {writedata[6]}]
set_fanout_load 8 [get_ports {writedata[5]}]
set_fanout_load 8 [get_ports {writedata[4]}]
set_fanout_load 8 [get_ports {writedata[3]}]
set_fanout_load 8 [get_ports {writedata[2]}]
set_fanout_load 8 [get_ports {writedata[1]}]
set_fanout_load 8 [get_ports {writedata[0]}]
set_load -pin_load 0.1 [get_ports memread]
set_load -pin_load 0.1 [get_ports memwrite]
set_load -pin_load 0.1 [get_ports {adr[7]}]
set_load -pin_load 0.1 [get_ports {adr[6]}]
set_load -pin_load 0.1 [get_ports {adr[5]}]
set_load -pin_load 0.1 [get_ports {adr[4]}]
set_load -pin_load 0.1 [get_ports {adr[3]}]
set_load -pin_load 0.1 [get_ports {adr[2]}]
set_load -pin_load 0.1 [get_ports {adr[1]}]
set_load -pin_load 0.1 [get_ports {adr[0]}]
set_load -pin_load 0.1 [get_ports {writedata[7]}]
set_load -pin_load 0.1 [get_ports {writedata[6]}]
set_load -pin_load 0.1 [get_ports {writedata[5]}]
set_load -pin_load 0.1 [get_ports {writedata[4]}]
set_load -pin_load 0.1 [get_ports {writedata[3]}]
set_load -pin_load 0.1 [get_ports {writedata[2]}]
set_load -pin_load 0.1 [get_ports {writedata[1]}]
set_load -pin_load 0.1 [get_ports {writedata[0]}]
set_max_fanout 1 [get_ports clk]
set_max_fanout 1 [get_ports reset]
set_max_fanout 1 [get_ports {memdata[7]}]
set_max_fanout 1 [get_ports {memdata[6]}]
set_max_fanout 1 [get_ports {memdata[5]}]
set_max_fanout 1 [get_ports {memdata[4]}]
set_max_fanout 1 [get_ports {memdata[3]}]
set_max_fanout 1 [get_ports {memdata[2]}]
set_max_fanout 1 [get_ports {memdata[1]}]
set_max_fanout 1 [get_ports {memdata[0]}]
create_clock [get_ports clk]  -period 40  -waveform {0 20}
set_clock_latency 0.3  [get_clocks clk]
set_input_delay -clock clk  2  [get_ports clk]
set_input_delay -clock clk  2  [get_ports reset]
set_input_delay -clock clk  2  [get_ports {memdata[7]}]
set_input_delay -clock clk  2  [get_ports {memdata[6]}]
set_input_delay -clock clk  2  [get_ports {memdata[5]}]
set_input_delay -clock clk  2  [get_ports {memdata[4]}]
set_input_delay -clock clk  2  [get_ports {memdata[3]}]
set_input_delay -clock clk  2  [get_ports {memdata[2]}]
set_input_delay -clock clk  2  [get_ports {memdata[1]}]
set_input_delay -clock clk  2  [get_ports {memdata[0]}]
set_output_delay -clock clk  1.65  [get_ports memread]
set_output_delay -clock clk  1.65  [get_ports memwrite]
set_output_delay -clock clk  1.65  [get_ports {adr[7]}]
set_output_delay -clock clk  1.65  [get_ports {adr[6]}]
set_output_delay -clock clk  1.65  [get_ports {adr[5]}]
set_output_delay -clock clk  1.65  [get_ports {adr[4]}]
set_output_delay -clock clk  1.65  [get_ports {adr[3]}]
set_output_delay -clock clk  1.65  [get_ports {adr[2]}]
set_output_delay -clock clk  1.65  [get_ports {adr[1]}]
set_output_delay -clock clk  1.65  [get_ports {adr[0]}]
set_output_delay -clock clk  1.65  [get_ports {writedata[7]}]
set_output_delay -clock clk  1.65  [get_ports {writedata[6]}]
set_output_delay -clock clk  1.65  [get_ports {writedata[5]}]
set_output_delay -clock clk  1.65  [get_ports {writedata[4]}]
set_output_delay -clock clk  1.65  [get_ports {writedata[3]}]
set_output_delay -clock clk  1.65  [get_ports {writedata[2]}]
set_output_delay -clock clk  1.65  [get_ports {writedata[1]}]
set_output_delay -clock clk  1.65  [get_ports {writedata[0]}]
set_drive 2  [get_ports test_si]
set_drive 2  [get_ports test_se]
